dangcaominh/STM32F427VIT6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LCD_INT_Pin GPIO_PIN_2
#define LCD_INT_GPIO_Port GPIOE
#define LCD_INT_EXTI_IRQn EXTI2_IRQn
#define LCD_NCS_Pin GPIO_PIN_3
#define LCD_NCS_GPIO_Port GPIOE
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define BL_PWM_Pin GPIO_PIN_10
#define BL_PWM_GPIO_Port GPIOB
#define CARD_DETECT_Pin GPIO_PIN_15
#define CARD_DETECT_GPIO_Port GPIOA
#define CAM_RST_Pin GPIO_PIN_3
#define CAM_RST_GPIO_Port GPIOD
#define LCD_NRST_Pin GPIO_PIN_6
#define LCD_NRST_GPIO_Port GPIOD
#define OV5640_SIOC_Pin GPIO_PIN_8
#define OV5640_SIOC_GPIO_Port GPIOB
#define OV5640_SIOD_Pin GPIO_PIN_9
#define OV5640_SIOD_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
